FILES/ChartsOfCharacteristicTypes/НаборХарактеристикСистемный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>НаборХарактеристикСистемный</Name>
			<Type>
				<v8:Type>cfg:EnumRef.ОтношениеУчетаСвязанныхНоменклатур</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыОписания</v8:Type>
				<v8:Type>cfg:CatalogRef.ФункцииОписания</v8:Type>
				<v8:Type>cfg:DocumentRef.СвязьНоменклатур</v8:Type>
				<v8:Type>cfg:DocumentRef.Смета</v8:Type>
				<v8:Type>cfg:TaskRef.ЗадачаКлиента</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказКлиентаБТ</v8:Type>
				<v8:Type>cfg:CatalogRef.ИсточникиЗаказов</v8:Type>
				<v8:Type>cfg:DocumentRef.ТревелПолитика</v8:Type>
				<v8:Type>cfg:DocumentRef.УсловияФормированияДокументов</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементОтбора</v8:Type>
				<v8:Type>cfg:CatalogRef.ПроектБТ</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗагрузкиВыгрузкиФайловИзДиректорий</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭлементСвязаннойНоменклатуры</v8:Type>
				<v8:Type>cfg:CatalogRef.Организации</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.НастройкиВыгрузкиОбъектов</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказИзКорзины</v8:Type>
				<v8:Type>cfg:CatalogRef.НастройкиЗагрузокУслуг</v8:Type>
				<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
				<v8:Type>cfg:CatalogRef.ОтчетыКлиента</v8:Type>
				<v8:Type>cfg:DocumentRef.КомиссииПоставщиков</v8:Type>
				<v8:Type>cfg:EnumRef.СобытияБТ</v8:Type>
				<v8:Type>cfg:CatalogRef.ТипыДанныхЭкстраСправочника</v8:Type>
				<v8:Type>cfg:CatalogRef.РегламентныеЗадачи</v8:Type>
				<v8:Type>cfg:CatalogRef.ВидыМест</v8:Type>
				<v8:Type>cfg:EnumRef.ТипыВложенныхФайлов</v8:Type>
				<v8:Type>cfg:DocumentRef.СписокДопУслуг</v8:Type>
				<v8:Type>cfg:CatalogRef.СервераШины</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:DocumentRef.УсловияСогласованияКомандировки</v8:Type>
				<v8:Type>cfg:CatalogRef.Места</v8:Type>
				<v8:Type>cfg:DocumentRef.АвтозаполнениеЭкстраПолей</v8:Type>
				<v8:Type>cfg:CatalogRef.Командированные</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:DocumentRef.СогласованиеКомандировки</v8:Type>
				<v8:Type>cfg:CatalogRef.ДополнительныйФункционал</v8:Type>
				<v8:Type>cfg:CatalogRef.ЭкстраСправочник</v8:Type>
				<v8:Type>cfg:DocumentRef.Услуга</v8:Type>
				<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИПечатныеФормы</v8:Type>
				<v8:Type>cfg:CatalogRef.РолиПользователейОБТ</v8:Type>
				<v8:Type>cfg:DocumentRef.ЗаказКомандированногоБТ</v8:Type>
				<v8:Type>cfg:EnumRef.СтатусыТревелПолитики</v8:Type>
				<v8:Type>cfg:EnumRef.СтатусыУслуг</v8:Type>
				<v8:Type>cfg:CatalogRef.ПользователиОБТ</v8:Type>
				<v8:Type>cfg:EnumRef.СтатусЗаказаКлиента</v8:Type>
				<v8:Type>cfg:EnumRef.СтатусыСогласования</v8:Type>
				<v8:Type>cfg:CatalogRef.НоменклатураБТ</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>256</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлючПоиска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

FILES/InformationRegisters/НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НаборХарактеристикСистемный</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НаборХарактеристикСистемный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FILES/ChartsOfCharacteristicTypes/НаборХарактеристикСистемный/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьКлючЗаписи(Характеристика)

    ЗначениеКлюча = Новый Структура;
    ЗначениеКлюча.Вставить("Характеристика", Характеристика);
	
	ЗначениеПоиска = РегистрыСведений.НастройкиСистемы.Получить(ЗначениеКлюча);
	Если ЗначениеПоиска.Значение = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("ЗначенияЗаполнения", ЗначениеКлюча);
	Иначе
		ПараметрыОткрытия = Новый Структура("Ключ", РегистрыСведений.НастройкиСистемы.СоздатьКлючЗаписи(ЗначениеКлюча));
	КонецЕсли;	

    Возврат ПараметрыОткрытия;

КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("РегистрСведений.НастройкиСистемы.ФормаЗаписи", ПолучитьКлючЗаписи(ВыбраннаяСтрока));
		
КонецПроцедуры
